Revit 2027 API
ParameterTypeId.RebarSystemHookTypeFrontDirn2 Property
 "Exterior Minor Hook Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarSystemHookTypeFrontDirn2 { get; }
Public Shared ReadOnly Property RebarSystemHookTypeFrontDirn2 As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarSystemHookTypeFrontDirn2 {
	ForgeTypeId^ get ();
}
static member RebarSystemHookTypeFrontDirn2 : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace